RogerHuauya/drogui/dspic/Blink/headers/MM7150.h
#ifndef MM7150_H
#define MM7150_H

#include <io.h>
#include <i2c.h>


typedef unsigned char UINT8;        // 8-bit variables
typedef unsigned char BOOL;
   
typedef unsigned int UINT16;      // 16-bit variables
typedef unsigned long UINT32;
#define TRUE 1
#define FALSE 0


//#include <app.h>

#define MENU_ITEMS          14

#define MENU_STR_LEN        19
#define MIN_MENU_SLCT            2


#define MAX_MENU_SLCT            12       
#define MAX_LINE_NUM            13

#define ACCEL_MENU_SLCT     2       //accelerometer
#define GYRO_MENU_SLCT      3       //gyrometer
#define COMP_MENU_SLCT      4       //compass
#define ORI_MENU_SLCT       5       //orientation
#define INCL_MENU_SLCT      6       //inclinometer
#define RAW_ACC_MENU_SLCT   7       //raw accelerometer
#define RAW_MAG_MENU_SLCT   8       //raw magnometer
#define RAW_GYRO_MENU_SLCT  9       //raw gyrometer
#define SLP_MENU_SLCT                10                //sleep 
#define WAKE_MENU_SLCT                11                //wake
#define FLASH_UPDATE_MENU_SLCT  12  //flash update



#define DBNCE_VAL           300     // Debounce timer value (empirically derived)
#define RAW_DATA_RATE       100
#define RAW_SENSITIVITY     100
#define RAW_SENSITIVITY_MIN 0x0

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include <stdint.h>
#include <stdbool.h>
#include <float.h>

#define PIN_INT PRTA, 14
#define PIN_RST PRTD, 3
void IntPinHandler();

typedef struct _sensor{
    
        UINT8 ucRetStat;                                                // return status value
        UINT16 wdata;                                                   // pre-exponent-scaled data
        double dDataX, dDataY, dDataZ, dDataW;          // Data field variables
        UINT16 wRMWdata;
        double dMult;
} sensor;


void initAccel(sensor* s, int rate, int sensitivity);
void readAccel(sensor* s);
void finishAccel(sensor*s);


void initOrient(sensor* s, int rate, int sensitivity);
void readOrient(sensor* s);
void finishOrient(sensor*s);


void initInclin(sensor* s, int rate, int sensitivity);
void readInclin(sensor* s);
void finishInclin(sensor*s);


void initCompass(sensor* s, int rate, int sensitivity);
void readCompass(sensor* s);
void finishCompass(sensor*s);


void initGyro(sensor* s, int rate, int sensitivity);
void readGyro(sensor* s);
void finishGyro(sensor*s);


void initRawAccel(sensor* s);
void readRawAccel(sensor* s);
void finishRawAccel(sensor*s);


void initRawMagnet(sensor* s);
void readRawMagnet(sensor* s);
void finishRawMagnet(sensor*s);

void initRawGyro(sensor* s);
void readRawGyro(sensor* s);
void finishRawGyro(sensor*s);

//#include "System.h"
void Wake_signal(void);

//#include "interrupts.h"
void InitTimer();
void InitI2CTimer();
void StartI2CTimer();
void StopI2CTimer();

//#include "VREGS.h"

#define VREG_RESET_INIT                 1
#define VREG_RESET_SUCCESS              0
#define VREG_SH_AWAKE                   1
#define VREG_SH_ASLEEP                  0

#define VREG_SHSTART_SUCCESS            1                           //status codes
#define VREG_SHSTART_FAIL               3
#define ARB_ID                          1                           // Arbitrary report ID to be used for POWER_ON and RESET commands (these commands do not require a specific ID)
#define MAX_RETRIES                     3                           // as per SF API spec

#define FULL_POWER                      0x02
#define LOW_POWER                       0x03

#define VREG_RST_CMD_SUCCESS            1
#define VREG_RESET_CMD_FAIL             3

#define VREG_WAKE_SUCCESS               2
#define VREG_WAKE_FAIL                  6
#define VREG_SLEEP_SUCCESS              1
#define VREG_SLEEP_FAIL                 5

#define VREG_ENABLE_SUCCESS             1
#define VREG_DISABLE_SUCCESS                2
#define VREG_ENA_DIS_FAIL               3

#define VREG_UPDATE_SENS_SUCCESS        1
#define VREG_UPDATE_SENS_FAIL           5
#define VREG_UPDATE_DATARATE_SUCCESS    2
#define VREG_UPDATE_DATARATE_FAIL       6

//****************************************************************************
//****************************************************************************
//  Section : Structures
//****************************************************************************
//****************************************************************************
/*****************************************************************************
                           VIRTUAL REGISTER - VREGs                               
******************************************************************************/

/*********************SENSOR HUB CONFIG REGISTER*****************************/

#define VREG_SHC                    0x00                            //Sensor Hub Configuration : VREG 0x00
#define VREG_SHC_WAKE_BIT           (1<<0)
#define VREG_SHC_SLP_BIT            (1<<1)
#define VREG_SHC_START_BIT          (1<<2)
#define VREG_SHC_RST_BIT            (1<<3)
#define VREG_SHC_ACC_EN             (1<<4)
#define VREG_SHC_GYRO_EN            (1<<5)
#define VREG_SHC_CMP_EN             (1<<6)
#define VREG_SHC_ORI_EN             (1<<7)
#define VREG_SHC_INC_EN             (1<<8)
#define VREG_SHC_RAWACC_EN          (1<<11)
#define VREG_SHC_RAWMAG_EN          (1<<12)
#define VREG_SHC_RAWGYR_EN          (1<<13)

#define VREG_SHC_ACC_EN_VAL         4
#define VREG_SHC_RAWACC_EN_VAL      11
#define VREG_SHC_RAWMAG_EN_VAL      12
#define VREG_SHC_RAWGYR_EN_VAL      13


struct SENSOR_HUB_CONFIG                                       
{
    unsigned SHwake:1;                                              // Set when device is awake
    unsigned sleep:1;                                               // Set to enter sleep; clears shWAKE bit
    unsigned SHstart:1;                                             // HID cannot be enabled unless set
    unsigned reset:1;                                               // Set to start HID reset and set all VREGS to POR
    unsigned AccelEnable:1;                                         // Set to enable accelerometer
    unsigned GyroEnable:1;                                          // Set to enable gyrometer
    unsigned CmpEnable:1;                                           // Set to enable compass
    unsigned OriEnable:1;                                           // Set to enable orientation sensor
    unsigned InclEnable:1;                                          // Set to enable inclinometer
    unsigned BarEnable:1;                                           // Set to enable BAR sensor
    unsigned AlsEnable:1;                                           // Set to enable ALS sensor
    unsigned RawAccelEnable:1;                                      // Set to enable user to read raw accelerometer data
    unsigned RawMagEnable:1;                                        // Set to enable user to read raw magnometer data
    unsigned RawGyroEnable:1;                                       // Set to enagle user to read raw gryrometer data
    unsigned :2;
};

/*************************SENSOR LIST REGISTER***************************
The list of available sensors can be acquired by parsing the report
descriptor table. Set bit when a sensor is foud to be availble.
************************************************************************/
#define VREG_SL         0x01                                        //Sensor List: VREG 0x01
struct SENSOR_LIST
{
    unsigned accel:1;                                               //sensor available bit
    unsigned gyro:1;           
    unsigned cmp:1;
    unsigned ori:1;
    unsigned incl:1;
    unsigned res:11;
};

