RogerHuauya/drogui/dspic/Blink/headers/MM7150.h
/*********************SENSIVITY REGISTERS*******************************
 Sensitivities of each sensor can be found by running GetFeature for
 each of the sensors and retrieving that parameter
************************************************************************/
#define VREG_ACSEN      0x02                                        //Acc Sensitivity: VREG 0x02
#define VREG_GYSEN      0x03                                        //Gyro Sensitivity: VREG 0x03
#define VREG_CMSEN      0x04                                        //Cmp Sensitivity: VREG 0x04
#define VREG_ORSEN      0x05                                        //Ori Sensitivity: VREG 0x05
#define VREG_INSEN      0x06                                        //Incl Sensitivity: VREG 0x06
#define VREG_RES07      0x07                                        //Reserved: VREG 0x07
#define VREG_RES08      0x08                                        //Reserved: VREG 0x08
#define VREG_RACSEN     0x09                                        //Raw Acc Sensitivity: VREG 0x09
#define VREG_RMGSEN     0x0A                                        //Raw Mag Sensitivity: VREG 0x0A
#define VREG_RGYSEN     0x0B                                        //Raw Gyro Sensitivity: VREG 0x0B

struct SENSIT_REGS
{
    UINT16 ACSEN;                                                   // Acc Sensitivity : VREG 0x02
    UINT16 GYSEN;                                                   // Gyro Sensitivity : VREG 0x03
    UINT16 CMSEN;                                                   // Cmp Sensitivity : VREG 0x04
    UINT16 ORSEN;                                                   // Ori Sensitivity : VREG 0x05
    UINT16 INSEN;                                                   // Incl Sensitivity : VREG 0x06
    UINT16 RES_VREG07;                                              // Reserved : VREG 0x07
    UINT16 RES_VREG08;                                              // Reserved : VREG 0x08
    UINT16 RACSEN;                                                  // Raw Acc Sensitivity : VREG 0x09
    UINT16 RMGSEN;                                                  // Raw MAg Sensitivity : VREG 0x0A
    UINT16 RGYSEN;                                                  // Raw Gyro Sensitivity : VREG 0x0B
};
/*************************DATA RATE REGISTERS***************************
 Data rates of each sensor can be found by running get feature for
 each of the sensors and retrieving that parameter
************************************************************************/
#define VREG_ACDXR      0x0C                                        //Acc DataRate: VREG 0x0C
#define VREG_GYDR       0x0D                                        //Gyro DataRate: VREG 0x0D
#define VREG_CMDR       0x0E                                        //Cmp DataRate: VREG 0x0E
#define VREG_ORDR       0x0F                                        //Ori DataRate: VREG 0x0F
#define VREG_INDR       0x10                                        //Incl DataRate: VREG 0x10
#define VREG_RES11      0x11                                        //Reserved: VREG 0x11
#define VREG_RES12      0x12                                        //Reserved: VREG 0x12
#define VREG_RACDR      0x13                                        //Raw Acc DataRate: VREG 0x13
#define VREG_RMGDR      0x14                                        //Raw Mag DataRate: VREG 0x14
#define VREG_RGYDR      0x15                                        //Raw Gyro DataRate: VREG 0x15

struct DATA_RT_REGS
{
    UINT16 ACDXR;                                                   // Acc DataRate : VREG 0x0C
    UINT16 GYDR;                                                    // Gyro DataRate : VREG 0x0D
    UINT16 CMDR;                                                    // Cmp DataRate : VREG 0x0E
    UINT16 ORDR;                                                    // Ori DataRate : VREG 0x0F
    UINT16 INDR;                                                    // Incl DataRate : VREG 0x10
    UINT16 RES_VREG11;                                              // Reserved : VREG 0x11
    UINT16 RES_VREG12;                                              // Reserved : VREG 0x12
    UINT16 RACDR;                                                   // Raw Acc DataRate : VREG 0x13
    UINT16 RMGDR;                                                   // Raw Mag DataRate : VREG 0x14
    UINT16 RGYDR;                                                   // Raw Gyro DataRate : VREG 0x15
};

/***************************DATA REGISTERS*******************************
 These registers should be updated with relevant data as it comes in
 during interrupts.
************************************************************************/
#define VREG_ACXD       0x16                                        //AccX Data: VREG 0x16
#define VREG_ACYD       0x17                                        //AccY Data: VREG 0x17
#define VREG_ACZD       0x18                                        //AccZ Data: VREG 0x18
#define VREG_RACXD      0x19                                        //Raw AccX Data: VREG 0x19
#define VREG_RACYD      0x1A                                        //Raw AccY Data: VREG 0x1A
#define VREG_RACZD      0x1B                                        //Raw AccZ Data: VREG 0x1B
#define VREG_GYXD       0x1C                                        //GyroX Data: VREG 0x1C
#define VREG_GYYD       0x1D                                        //GyroY Data: VREG 0x1D
#define VREG_GYZD       0x1E                                        //GyroZ Data: VREG 0x1E
#define VREG_RGYXD      0x1F                                        //Raw GyroX Data: VREG 0x1F
#define VREG_RGYYD      0x20                                        //Raw GyroY Data: VREG 0x20
#define VREG_RGYZD      0x21                                        //Raw GyroZ Data: VREG 0x21
#define VREG_CMD        0x22                                        //Cmp Data: VREG 0x22
#define VREG_MGFXD      0x23                                        //Mag FluxX Data: VREG 0x23
#define VREG_MGFYD      0x24                                        //Mag FluxY Data: VREG 0x24
#define VREG_MGFZD      0x25                                        //Mag FluxZ Data: VREG 0x25
#define VREG_RMGXD      0x26                                        //Raw MagX Data: VREG 0x26
#define VREG_RMGYD      0x27                                        //Raw MagY Data: VREG 0x27
#define VREG_RMGZD      0x28                                        //Raw MagZ Data: VREG 0x28
#define VREG_ORXD       0x29                                        //OriX Data: VREG 0x29
#define VREG_ORYD       0x2A                                        //OriY Data: VREG 0x2A
#define VREG_ORZD       0x2B                                        //OriZ Data: VREG 0x2B
#define VREG_ORWD       0x2C                                        //OriW Data: VREG 0x2C
#define VREG_INXD       0x2D                                        //InclX Data: VREG 0x2D
#define VREG_INYD       0x2E                                        //InclY Data: VREG 0x2E
#define VREG_INZD       0x2F                                        //InclZ Data: VREG 0x2F
#define VREG_RES30      0x30                                        //Reserved: VREG 0x30
#define VREG_RES31      0x31                                        //Reserved: VREG 0x31
#define VREG_RES32      0x32                                        //Reserved: VREG 0x32
#define VREG_RES33      0x33                                        //Reserved: VREG 0x33
#define VREG_RES34      0x34                                        //Reserved: VREG 0x34
#define VREG_RES35      0x35                                        //Reserved: VREG 0x35

struct DATA_REGS
{
    UINT16 ACXD;                                                    // AccX Data : VREG 0x16
    UINT16 ACYD;                                                    // AccY Data : VREG 0x17
    UINT16 ACZD;                                                    // AccZ Data : VREG 0x18
    UINT16 RACXD;                                                   // Raw AccX Data : VREG 0x19
    UINT16 RACYD;                                                   // Raw AccY Data : VREG 0x1A
    UINT16 RACZD;                                                   // Raw AccZ Data : VREG 0x1B
    UINT16 GYXD;                                                    // GyroX Data : VREG 0x1C
    UINT16 GYYD;                                                    // GyroY Data : VREG 0x1D
    UINT16 GYZD;                                                    // GyroZ Data : VREG 0x1E
    UINT16 RGYXD;                                                   // Raw GyroX Data : VREG 0x1F
    UINT16 RGYYD;                                                   // Raw GyroY Data : VREG 0x20
    UINT16 RGYZD;                                                   // Raw GyroZ Data : VREG 0x21
    UINT16 CMD;                                                     // Cmp Data : VREG 0x22
    UINT16 MGFXD;                                                   // Mag FluxX Data: VREG 0x23
    UINT16 MGFYD;                                                   // Mag FluxY Data: VREG 0x24
    UINT16 MGFZD;                                                   // Mag FluxZ Data: VREG 0x25
    UINT16 RMGXD;                                                   // Raw MagX Data : VREG 0x26
    UINT16 RMGYD;                                                   // Raw MagY Data : VREG 0x27
    UINT16 RMGZD;                                                   // Raw MagZ Data : VREG 0x28
    UINT16 ORXD;                                                    // OriX Data : VREG 0x29
    UINT16 ORYD;                                                    // OriY Data : VREG 0x2A
    UINT16 ORZD;                                                    // OriZ Data : VREG 0x2B
    UINT16 ORWD;                                                    // OriW Data : VREG 0x2C
    UINT16 INXD;                                                    // InclX Data : VREG 0x2D
    UINT16 INYD;                                                    // InclY Data : VREG 0x2E
    UINT16 INZD;                                                    // InclZ Data : VREG 0x2F
    UINT16 RES_VREG30;                                              // Reserved : VREG 0x30
    UINT16 RES_VREG31;                                              // Reserved : VREG 0x31
    UINT16 RES_VREG32;                                              // Reserved : VREG 0x32
    UINT16 RES_VREG33;                                              // Reserved : VREG 0x33
    UINT16 RES_VREG34;                                              // Reserved : VREG 0x34
    UINT16 RES_VREG35;                                              // Reserved : VREG 0x35
};

