RogerHuauya/drogui/dspic/Blink/headers/MM7150.h
//**********************************ID Registers****************************************
#define VREG_PID        0x36                                        //Product ID: VREG 0x36
#define VREG_VID        0x37                                        //Vendor ID: VREG 0x37
#define VREG_DID        0x38                                        //Device ID: VREG 0x38

struct IDS
{
    UINT16 PID;                                                     //ProductID : VREG 0x36   Note:  The product ID can be retrieved from the HID descriptor table
    UINT16 VID;                                                     //VendorID : VREG 0x37  Note: The vendor ID can be retrieved from the HID descriptor table
    UINT16 DID;                                                     //DeviceID : VREG 0x38 Note: The device ID can be retrieved from the HID descriptor table
};

/*************************EXPONENT REGISTERS***************************
**********************************************************************/
#define VREG_EXP1       0x39                                        //Exponent1: VREG 0x39
struct EXPONENT1                    
{
    unsigned expA:4;
    unsigned expG:4;
    unsigned expC:4;
    unsigned expO:4;
};

#define VREG_EXP2       0x3A                                        //Exponent2: VREG 0x3A
struct EXPONENT2                     
{
    unsigned expIN:4;
    unsigned expB:4;
    unsigned expAL:4;
    unsigned expRA:4;
};

#define VREG_EXP3       0x3B                                        //Exponent3: VREG 0x3B
struct EXPONENT3                     
{
    unsigned expRM:4;
    unsigned expRG:4;
    unsigned res:8;
};

//**********************Structure of the Exponents ************************
struct EXPONENT
{
    struct EXPONENT1 exp1;
    struct EXPONENT2 exp2;
    struct EXPONENT3 exp3;
};

#define VREG_EXPCSS1    0x3C                                        //ExponentCS1: VREG 0x3C
struct EXPONENTCS1                   
{
    unsigned expCSA:4;
    unsigned expCSG:4;
    unsigned expCSC:4;
    unsigned expCSO:4;
};

#define VREG_EXPCSS2    0x3D                                        //ExponentCS2: VREG 0x3D
struct EXPONENTCS2
{
    unsigned expSCIN:4;
    unsigned expCSB:4;
    unsigned expCSAL:4;
    unsigned expCSRA:4;
};

#define VREG_EXPCSS3    0x3E                                        //ExponentCS3: VREG 0x3E
struct EXPONENTCS3                   
{
    unsigned expCSRM:4;
    unsigned expCSRG:4;
    unsigned res:8;
};

//**********************Structure of the Exponents ************************
struct EXPONENTCS
{
    struct EXPONENTCS1 expCS1;
    struct EXPONENTCS2 expCS2;
    struct EXPONENTCS3 expCS3;
};

//***********************Structure for Status******************************
#define VREG_STAT1      0x3F                                        //Status 1: VREG 0x3F
struct STATUS1                       
{
    unsigned Accstatus:2;
    unsigned GyroStatus:2;
    unsigned CmpStatus:2;
    unsigned OriStatus:2;
    unsigned IncStatus:2;
    unsigned ResStatus1:2;
    unsigned ResStatus2:2;
    unsigned RawAccStatus:2;
};

#define VREG_STAT2      0x40                                        //Status 2 VREG 0x40
#define STATUS1_MASK    0x03
#define STATUS2_MASK    0x07
struct STATUS2                       
{
    unsigned RawMagStatus:2;
    unsigned RawGyroStatus:2;
    unsigned AccCSData:3;
    unsigned GyroCSData:3;
    unsigned CmpCSData:3;
    unsigned OriCSData:3;
};

#define VREG_STAT3      0x41                                        //Status 3: VREG 0x41
struct STATUS3                       
{
    unsigned InclCSData:3;
    unsigned resCSData1:3;
    unsigned resCSData2:3;
    unsigned RawAccCSData:3;
    unsigned RawMagCSData:3;
    unsigned res:1;
};

#define VREG_STAT4      0x42                                        //Status 4: VREG 0x42
struct STATUS4                       
{
    unsigned RawGyroCSDAta:3;
    unsigned SHStartStatus:2;
    unsigned ResetStatus:2;
    unsigned ShSleepWakeStatus:3;
    unsigned res:6;
};

struct STATUS
{
    struct STATUS1 stat1;
    struct STATUS2 stat2;
    struct STATUS3 stat3;
    struct STATUS4 stat4;
};


typedef struct _SF_VREGS{
    struct SENSOR_HUB_CONFIG SHC;
    struct SENSOR_LIST SL;
    struct SENSIT_REGS sensitivity;
    struct DATA_RT_REGS data_rt;
    struct DATA_REGS _data;
    struct IDS IDs;
    struct EXPONENT expo;
    struct EXPONENTCS expCS;
    struct STATUS stat;
} SF_VREGS;


typedef struct SENSOR                                               // parameters for individual sensors
{
   UINT8 id;
   UINT8 type;
   UINT8 DatRtOffset;
   UINT8 SensOffset;
   UINT8 SensExp;
   UINT8 DatOffset;
   UINT8 DatExp;
} SF_SENSOR, SF_TEMP;

typedef struct GET_SET_PARAMS
{
    UINT8 ucid;
    UINT8 ucPowerState;
    UINT16 usSensitivityVal;
    BOOL bSensitivityValid;
    UINT16 usDataRateVal;
    BOOL bDataRateValid;
} GET_SET_PARAMS;

UINT8 initMM7150();
UINT8 HOST_SF_LIB_VREG_read(UINT8, UINT16 *);
UINT8 HOST_SF_LIB_VREG_write(UINT8, UINT16 );
void parse_update_VREG_data (UINT8, UINT8 *);

//#include "i2cIO.h"

#define CONFIG_I2C_VAL  0x8000
#define CONFIG_BRG_VAL  8
#define WRITE           1
#define READ            2
#define WR_RD           3
#define SLAVE_ADDR      0x40

void gets_I2C1(UINT8 *, UINT16, BOOL);
UINT8 i2c_cmd_WrRd(UINT8, UINT8,  UINT8 *, UINT16,  UINT8 *, BOOL);


//#include "sf.h"

#define GET_HID_DESC            1
#define GET_RPT_DESC            2
#define RESET_DEV_CMD           1
#define POWER_ON                2
#define SLEEP                   3
#define HID_GET_RPT_INPT        4
#define HID_GET_RPT_FEAT        5
#define HID_SET_RPT_OUTP        6
#define HID_SET_RPT_FEAT        7

#define HID_DESC_CMD_LSB        01
#define HID_DESC_CMD_MSB        00
#define DESC_CMD_LEN            2
                                 
#define BUF_40                  40                                  //temp buffer size = 40 bytes
#define BUF_30                  30                                  //temp buffer size = 30 bytes
#define BUF_150                 150
#define HID_CNFG_LEN            BUF_30
#define HID_RPT_LEN             3500                                //size of HID Report Descriptor


#define BYTE_ADJ_VAL            3

#define HID_COLLECTION          0xA1
#define HID_PHYSICAL            0x00
#define HID_REPORT_ID           0x85

#define GF_SENS_OFFSET_MSB      7
#define GF_SENS_OFFSET_LSB      6
#define GF_DATR_OFFSET_MSB      4
#define GF_DATR_OFFSET_LSB      3


#define TIMEOUT_11MS            11                                  // set timeout for 11 ms per API spec
#define TIMEOUT_5SEC            5000                                // RESET timeout 5 secs per HID spec
#define NUM_SENS                12                                  // max number of sensors per API spec

#define VREG_MAX_OFFSET         0x3F                                // Maximum VREG offset

#define RESET_CMD_MSB           0x01                                // RESET command bytes
#define RESET_CMD_LSB           0x00
#define CMD_LEN                 0x04

#define POWER_CMD_MSB           0x08                                // POWER command bytes
#define POWER_CMD_LSB           0x00
#define SLEEP_ON_LSB            0x01                                // SLEEP command bytes

#define GET_RPT_CMD_MSB         0x02                                // GET REPORT commmand bytes
#define GET_RRT_INPT            0x10
#define GET_RPT_FEAT            0x30

#define RPT_LEN                 6

#define SET_RPT_OUT             0x20                                // SET REPORT command bytes
#define SET_RPT_FEAT            0x30
#define SET_OPCODE              0x03

#define BYTE_SHIFT              8

// Report Feature Defines
#define RPT_SIZE_LSB            0
#define RPT_REPORT_STATE        4
#define RPT_PWR_STATE           5
#define RPT_SENS_STATE          6
#define RPT_REPORT_INTVAL_LSB   7
#define RPT_REPORT_INTVAL_MSB   8
#define RPT_CHG_SENS_LSB        13
#define RPT_CHG_SENS_MSB        14

// REPORT PARSE MACROS
#define HID_USAGE_SENSOR_PROPERTY_REPORTING_STATE_ALL_EVENTS_ENUM 0x02
#define HID_USAGE_SENSOR_TYPE                   0x09
#define HID_USAGE_SENSOR_PROPERTY               0x0A
#define HID_USAGE_SENSOR_PROPERTY_CONN_TYPE     0x09                //HID byte sequence : 0x0A,0x09,0x03
#define HID_USAGE_SENSOR_PROPERTY_RPT_STATE     0x16                //HID byte sequence : 0x0A,0x16,0x03
#define HID_USAGE_SENSOR_PROPERTY_PWR_STATE     0x19                //HID byte sequence : 0x0A,0x19,0x03
#define HID_USAGE_SENSOR_                       0x0A
#define HID_USAGE_SENSOR_STATE_1                0x01                //HID byte sequence : 0x0A,0x01,0x02
#define HID_USAGE_SENSOR_STATE_2                0x02                //HID byte sequence : 0x0A,0x01,0x02
#define HID_USAGE_SENSOR_EVENT_1                0x02                //HID byte sequence : 0x0A,0x02,0x02
#define HID_USAGE_SENSOR_EVENT_2                0x02                //HID byte sequence : 0x0A,0x02,0x02
#define HID_USAGE_SENSOR_PROPERTY_RPT_INT       0x0E                //HID byte sequence : 0x0A,0x0E,0x03


