RogerHuauya/drogui/dspic/Blink/headers/MM7150.h
#define HID_USAGE_SENSOR_DATA_ACCU              0x44                //the sensor data accuracy value is the #define HID_USAGE_SENSOR_DATA(a,b) value (where (a|b)).
                                                                    // For example, for the accelerometer: 	HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION,HID_USAGE_SENSOR_DATA_MOD_ACCURACY)
                                                                    //  HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION | HID_USAGE_SENSOR_DATA_MOD_ACCURACY = 0x04 | 0x40 = 0x44 this is accuracy value for Non-RAW sensors
#define HID_USAGE_SENSOR_DATA_RAW_ACCU          0x45                //the sensor data accuracy value is the #define HID_USAGE_SENSOR_DATA(a,b) value (where (a|b)).
                                                                    // For example, for RAW sensor: 	HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_CUSTOM_VALUE,HID_USAGE_SENSOR_DATA_MOD_ACCURACY),
                                                                    //  HID_USAGE_SENSOR_DATA_CUSTOM_VALUE | HID_USAGE_SENSOR_DATA_MOD_ACCURACY = 0x05 | 0x40 = 0x45 this is accuracy value for RAW sensors

#define HID_USAGE_SENSOR_DATA_RES               0x54                //see above comment for 'HID_USAGE_SENSOR_DATA_ACCU'substituting 'HID_USAGE_SENSOR_DATA_MOD_RESOLUTION' for 'HID_USAGE_SENSOR_DATA_MOD_ACCURACY'
                                                                    //  HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION,HID_USAGE_SENSOR_DATA_MOD_RESOLUTION)
                                                                    //  where #define HID_USAGE_SENSOR_DATA_MOD_RESOLUTION 0x50
#define HID_USAGE_SENSOR_DATA_RAW_RES           0x55                //  HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_CUSTOM_VALUE,HID_USAGE_SENSOR_DATA_MOD_RESOLUTION)

#define HID_USAGE_SENSOR_DATA_MOD_SENS          0x14                //see above comment for 'HID_USAGE_SENSOR_DATA_ACCU'substituting 'HID_USAGE_SENSOR_DATA_MOD_CHANGE_SENSITIVITY_ABS' for 'HID_USAGE_SENSOR_DATA_MOD_ACCURACY'
                                                                    // HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION,HID_USAGE_SENSOR_DATA_MOD_CHANGE_SENSITIVITY_ABS)
                                                                    // where #define HID_USAGE_SENSOR_DATA_MOD_CHANGE_SENSITIVITY_ABS 0x10
#define HID_USAGE_SENSOR_DATA_RAW_MOD_SENS      0x15                // HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_CUSTOM_VALUE,HID_USAGE_SENSOR_DATA_MOD_CHANGE_SENSITIVITY_ABS)

#define HID_USAGE_SENSOR_DATA_MOD_MAX           0x24                //see above comment for 'HID_USAGE_SENSOR_DATA_ACCU'substituting 'HID_USAGE_SENSOR_DATA_MOD_MAX' for 'HID_USAGE_SENSOR_DATA_MOD_ACCURACY'
                                                                    //HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION,HID_USAGE_SENSOR_DATA_MOD_MAX)
                                                                    // where #define HID_USAGE_SENSOR_DATA_MOD_MAX 0x20
#define HID_USAGE_SENSOR_DATA_RAW_MOD_MAX       0x25                //HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_CUSTOM_VALUE,HID_USAGE_SENSOR_DATA_MOD_MAX)

#define HID_USAGE_SENSOR_DATA_MOD_MIN           0x34                //see above comment for 'HID_USAGE_SENSOR_DATA_ACCU'substituting 'HID_USAGE_SENSOR_DATA_MOD_MIN' for 'HID_USAGE_SENSOR_DATA_MOD_ACCURACY'
                                                                    //HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_MOTION_ACCELERATION,HID_USAGE_SENSOR_DATA_MOD_MIN)
                                                                    // where #define HID_USAGE_SENSOR_DATA_MOD_MIN 0x30
#define HID_USAGE_SENSOR_DATA_RAW_MOD_MIN       0x35                //HID_USAGE_SENSOR_DATA(HID_USAGE_SENSOR_DATA_CUSTOM_VALUE,HID_USAGE_SENSOR_DATA_MOD_MIN)

#define HID_UNIT_EXP                            0x55                //  HID_UNIT_EXPONENT = 0x55

#define HID_END_COLLECTION      0xC0

#define ACCEL_VREG_OFFSET       0                                   // SENSOR TYPES (set in order that they are stored in VREGS struct)
#define GYRO_VREG_OFFSET        1
#define CMP_VREG_OFFSET         2
#define ORI_VREG_OFFSET         3
#define INCL_VREG_OFFSET        4
#define RAW_VREG_OFFSET         7           
#define RAW_ACC_VREG_OFFSET     7
#define RAW_MAG_VREG_OFFSET     8
#define RAW_GYR_VREG_OFFSET     9

#define ACCEL_SENSOR_TYPE       0x73
#define GYRO_SENSOR_TYPE        0x76               
#define CMP_SENSOR_TYPE         0x83               
#define ORI_SENSOR_TYPE         0x8A               
#define INCL_SENSOR_TYPE        0x86               
#define RAW_SENSOR_TYPE         0xE1

UINT16 hid_i2c_descriptor_handler(UINT8 );
UINT8 hid_i2c_cmd_process(UINT8 *, UINT8 , UINT8 );
double ret_exponent(UINT8);
UINT8 report_parse(UINT8 *);

UINT8 HOST_SF_LIB_HID_Set_Report(UINT8, UINT8*, UINT8);
UINT8 HOST_SF_LIB_HID_Get_Report(UINT8, UINT8*, UINT8);

typedef struct HID_DESCRIPTOR_TABLE                                 // Struct to store HID descriptor fields
{
    UINT16 wHIDDescLen;                                             // MSB 1; LSB 0
    UINT16 wRepDescLen;                                             // MSB 5; LSB 4
    UINT16 wRepDescReg;                                             // MSB 6; LSB 7
    UINT16 wMaxInpLen;                                              // MSB 11; LSB 10
    UINT16 wCmdReg;                                                 // MSB 17; LSB 16
    UINT16 wDatReg;                                                 // MSB 19; LSB 18
    UINT16 wVenID;                                                  // MSB 21; LSB 20
    UINT16 wProdID;                                                 // MSB 23; LSB 22
    UINT16 wVerID;                                                  // MSB 25; LSB 24
} HID_DESCRIPTOR_TABLE;

//#include "flashupdate.h"

#define GET_OPCODE                  0x02
#define FLASH_UPDATE_RPT_ID         0xE
#define FLASH_UPDATE_RESET_CMD      0x55
#define FLASH_UPDATE_BLDR_INFO_CMD  0xAA
#define LABEL_INFO_INDEX            15
#define FLASH_INFO_CMD              0x1
#define FLASH_WRITE_CMD             0x3
#define FLASH_READ_CMD              0x4


#define TOTAL_64BYTE_PKTS           1636                            //(SF memory area to be 102400 bytes, hence 104448/64 + 4 pkts added during encryption)
#define PACKET_LENGTH               128
#define FLSH_WR_DATA_INDEX          9                               // during flash write actual data starts from index 9
#define MAX_ERRORS                  20

//#include "err.h"

// Error code definitions 
#define SUCCESS             0 

//i2c definitions
#define I2_TIMEOUT_PERIOD 500                                       //500 ms

#define I2C_SUCCESS     0
#define I2C_ERROR       (0x21)
#define I2C_BUF_OVRFLO  (0x22)
#define WRITE_COLL      (0x23)
#define NOT_ACK         (0x24)
#define BUS_COLL        (0x25)
#define RX_OVRFLO       (0x26)
#define HID_DESC_RET    (0x27)
#define REP_DESC_RET    (0x28)
#define I2C_TIMEOUT_ERR (0x29)

#define ACKSTAT_bit     (1<<15)
#define BCL_bit         (1<<10)
#define IWOL_bit        (1<<7)
#define I2COV_bit       (1<<6)

//sf.h error definitions
//error codes
#define ID_FAIL                 (0x10)
#define HID_DESC_FAIL           (0x11)
#define RPT_DESC_FAIL           (0x12)
#define REP_PARS_FAIL           (0x14)
#define NO_EOC_FAIL             (0x15)
#define GET_FEAT_FAIL           (0x16)
#define SET_FEAT_FAIL           (0x17)
#define RESET_FAIL              (0x18)
#define SET_RPT_FAIL            (0x19)
#define POWER_ON_FAIL           (0x1A)
#define SLEEP_CMD_FAIL          (0x1B)
#define HID_GET_RPT_INPT_FAIL   (0x1C)
#define HID_GET_RPT_FEAT_FAIL   (0x1D)
#define WAKE_CMD_FAIL           (0x1E)
   
#define HID_INT_FAIL            (0x31)
#define VREG_ACCESS_ERR         (0x32)
#define VREG_OFFSET_ERR         (0x33)

#define FLSH_INFO_ERR           (0x41)
#define FLSH_WRITE_ERR          (0x42)
#define FLSH_VERIFY_ERR         (0x43)
#define FLSH_CRC_ERR            (0x44)
//****************************************************************************
//****************************************************************************
//  Section : Function Declarations
//****************************************************************************
//****************************************************************************

void i2cIO_error(UINT8);
void error_handler(char *s, UINT16, UINT16);
void StartI2CTimer();                                               //use timer2 interrupt to recover from unresponsive i2c transactions
void StopI2CTimer();

//#include "sensors.h"

#endif